УчетВУправляющихДляГит1/src/InformationRegisters/УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией/УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ЗаЗанятыхНаПодземныхИВредныхРаботах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией/ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ЗаЗанятыхНаПодземныхИВредныхРаботах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/УдалитьТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьТарифыДополнительныхВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией();
	
КонецПроцедуры

Процедура ЗаполнитьТарифыДополнительныхВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией()

	НаборЗаписей = РегистрыСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СоздатьНаборЗаписей();	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20130101';
	Запись.ЗаЗанятыхНаПодземныхИВредныхРаботах = 4;
	Запись.ЗаЗанятыхНаТяжелыхИПрочихРаботах = 2;
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20140101';
	Запись.ЗаЗанятыхНаПодземныхИВредныхРаботах = 6;
	Запись.ЗаЗанятыхНаТяжелыхИПрочихРаботах = 4;
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20150101';
	Запись.ЗаЗанятыхНаПодземныхИВредныхРаботах = 9;
	Запись.ЗаЗанятыхНаТяжелыхИПрочихРаботах = 6;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
